Repository: sheilagomes/wp-trad
Catalog: tm/PHP_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: If none of the values is a float, all of them will be treated as integer s, and an integer is returned.
pt_br: Se nenhum dos valores é um float, todos eles serão tratados como inteiros, e um inteiro será retornado.

source: Upon failure, min() returns NULL and an error of level E_WARNING is generated.
pt_br: Em caso de falha, min() retorna NULL e um erro nível E_WARNING é registrado

source: ?php $a = 4; $b = 9; $c = 3; $arr = array(99, 34, 11); / / You may want to implement your own error checking in / / case of failure (a variable may not be set) if (!$min_value = @min($a, $b, $c)) {echo "Could not get min value, please try again .";} else {echo "min value is $min_value";} print min($arr); / / 11?
pt_br: ?php $a = 4; $b = 9; $c = 3; $arr = array(99, 34, 11); / / Você pode querer implementar sua própria checagem / / no caso de falha (uma variável pode não existir) if (!$min_value = @min($a, $b, $c)) {echo "Não pude obter o menor valor, tente novamente .";} else {echo "O menor valor é $min_value";} print min($arr); / / Exibe 11?

source: See also max().
pt_br: Veja também max().

source: Note that you probably want to specify the mode as an octal number, which means it should have a leading zero.
pt_br: Tenta criar o diretório pathname.

source: The mode is 0777 by default, which means the widest possible access.
pt_br: O mode é também modificado pela umaks atual, o que você pode mudar usando umask().

source: See also rmdir().
pt_br: Veja também rmdir().

source: Warning:
pt_br: Descrição

source: It is a common error to mix these values up in a script.
pt_br: Note a estranha ordem dos argumentos, que diferem da ordem dos argumentos em um chamada regular da UNIX mktime() e que não combina bem com si mesma para a omissão dos parâmetros da direita para a esquerda (veja abaixo). é um erro comum misturar estes valores acima em um script.

source: Returns the Unix timestamp corresponding to the arguments given.
pt_br: Retorna o timestamp Unix correspondente para os argumentos dados.

source: This timestamp is a long integer containing the number of seconds between the Unix Epoch (January 1 1970) and the time specified.
pt_br: Este timestamp é um longo inteiro contendo o número de segundos entre a Era Unix (January 1 1970) e o tempo especificado.

source: Arguments may be left out in order from right to left; any arguments thus omitted will be set to the current value according to the local date and time.
pt_br: Argumentos podem ser omitidos da direita para esquerda; quaisquer argumentos assim omitidos serão definidos para o valor atual de acordo com a data e a hora local.

source: is_dst can be set to 1 if the time is during daylight savings time, 0 if it is not, or -1 (the default) if it is unknown whether the time is within daylight savings time or not.
pt_br: is_dst pode ser definido para 1 se está durante o horário de verão, 0 se não estiver, ou -1 (o padrão) se não se sabe se está em horário de verão ou não.

source: If it 's unknown, PHP tries to figure it out itself.
pt_br: Se é desconhecido, o PHP tenta calcular.

source: This can cause unexpected (but not incorrect) results.
pt_br: Isto pode causar resultados inesperados (mas não incorretos).

source: mktime() is useful for doing date arithmetic and validation, as it will automatically calculate the correct value for out-of-range input.
pt_br: mktime() é útil para fazer data aritimética e validação, ela calculará automaticamente o valor correto para um receptor fora de linha.

source: For example, each of the following lines produces the string "Jan-01-1998".
pt_br: Por exemplo, cada uma das seguintes linhas produz a string "Jan-01-1998".

source: Example 1. mktime() example
pt_br: Exemplo 1. mktime() exemplo

source: The last day of any given month can be expressed as the "0" day of the next month, not the -1 day.
pt_br: O último dia de qualquer mês pode ser expresso como o dia "0" do próximo mês, não o dia -1.

source: Both of the following examples will produce the string "The last day in Feb 2000 is:
pt_br: Os seguintes exemplos produzirão a string "The last day in Feb 2000 is:

source: Last day of next month
pt_br: Ultimo dia do próximo mês

source: Date with year, month and day equal to zero is considered illegal (otherwise it what be regarded as 30.11.1999, which would be strange behavior).
pt_br: Data com ano, mês e dia igual a zero é considerado ilegal (senão ele é considerado como 30.11.1999, que poderia ser um comportamento estranho).

source: See also date() and time().
pt_br: Veja também date() e time().

source: money_format() returns a formatted version of number.
pt_br: Description

source: Example 1. money_format() Example
pt_br: Exemplo 1. money_format() Example

source: This function checks to ensure that the file designated by filename is a valid upload file (meaning that it was uploaded via PHP's HTTP POST upload mechanism).
pt_br: Esta função primeiro checa o arquivo informado nomedoarquivo é um arquivo válido uploadeado (significando que ele foi carregado pelo mecanismo do PHP de HTTP POST).

source: If the file is valid, it will be moved to the filename given by destination.
pt_br: Se o arquivo é válido, ele será movido para o nomedoarquivo dado pelo destino.

source: If filename is not a valid upload file, then no action will occur, and move_uploaded_file() will return FALSE.
pt_br: Se nomedoarquivo não é um arquivo carregado válido, então não haverá nenhuma ação e move_uploaded_file() irá retornar FALSE.

source: If filename is a valid upload file, but cannot be moved for some reason, no action will occur, and move_uploaded_file() will return FALSE.
pt_br: Se nomedoarquivo é um arquivo uploadeado válido e não pode ser movido por alguma razão, nenhuma ação irá ocorrer, e move_uploaded_file() irá retornar FALSE.

source: Additionally, a warning will be issued.
pt_br: Adicionalmente, um aviso será emitido.

source: This is not unsafe because move_uploaded_file() only operates on files uploaded via PHP.
pt_br: Isto não é inseguro porque move_uploaded_file() somente opera sobre arquivos carregados pelo PHP.

source: See also is_uploaded_file(), and the section Handling file uploads for a simple usage example.
pt_br: Veja também is_uploaded_file() e a seção Manipulando o upload de arquivos para um exemplo de utilização desta função.

source: Returns TRUE on success, FALSE on error.
pt_br: Description

source: msql_data_seek() moves the internal row pointer of the mSQL result associated with the specified query identifier to point to the specifyed row number.
pt_br: Retorna TRUE em caso de sucesso ou FALSE em falhas.

source: msql_drop_db() attempts to drop (remove) an entire database from the server associated with the specified link identifier.
pt_br: Retorna TRUE em caso de sucesso ou FALSE em falhas.

source: See msql_drop_db().
pt_br: msql_dropdb - - Drop (delete) mSQL database

source: Returns an object containing field information
pt_br: Description

source: Seeks to the specified field offset.
pt_br: Description

source: msql_free_result() frees the memory associated with query_identifier.
pt_br: Description

source: See msql_free_result()
pt_br: msql_freeresult - - Free result memory

source: MySQL Functions
pt_br: MySQL

source: See msql_list_dbs().
pt_br: msql_listdbs - - List mSQL databases on server

source: See msql_list_fields().
pt_br: msql_listfields - - List result fields

source: See msql_list_tables().
pt_br: msql_listtables - - List tables in an mSQL database

source: Example 1. msql_query()
pt_br: Exemplo 1. msql_query()

source: See sql_regcase().
pt_br: msql_regcase - - Make regular expression for case insensitive match

source: See msql_select_db().
pt_br: msql_selectdb - - Select mSQL database

source: Example 1. msql_tablename() example
pt_br: Exemplo 1. msql_tablename() example

source: See also mssql_execute(), mssql_free_statement() and mssql_init()
pt_br: Esta função não está documentada, somente a lista de argumentos está disponível.

source: TRUE on success, FALSE on error.
pt_br: Retorna:

source: mssql_close() closes the link to a MS SQL Server database that's associated with the specified link identifier.
pt_br: mssql_close() fecha a conexão com o MS SQL Server que esta associado ao identificador de conexão(link_identifier) indicado.

source: If the link identifier isn 't specified, the last opened link is assumed.
pt_br: Se o identificador de conexão não é especificado, a ultima conexão aberta é usada.

source: Note that this isn' t usually necessary, as non-persistent open links are automatically closed at the end of the script's execution.
pt_br: Note que isto não é usualmente necessário, já que conexões não persistentes são automaticamente fechadas ao final da execução do script.

source: mssql_close() will not close persistent links generated by mssql_pconnect().
pt_br: mssql_close() não irá fechar conexões persistentes geradas por mssql_pconnect().

source: See also: mssql_connect(), mssql_pconnect().
pt_br: Veja também: mssql_connect(), mssql_pconnect().

source: A positive MS SQL link identifier on success, or FALSE on error.
pt_br: Retorna: um identificador de link positivo com o servidor MS SQL se funcionar, ou FALSE se houver erro.

source: mssql_connect() establishes a connection to a MS SQL server.
pt_br: mssql_connect() estabelece uma conexão com um servidor MS SQL.

source: The servername argument has to be a valid servername that is defined in the 'interfaces' file.
pt_br: O argumento nomedoservidor tem que ser um nome de servidor que esteja definido no arquivo 'interfaces'.

source: In case a second call is made to mssql_connect() with the same arguments, no new link will be established, but instead, the link identifier of the already opened link will be returned.
pt_br: No caso de uma segunda chamada for feita para mssql_connect() com os mesmos argumentos, não será criada uma nova conexão, mas ao invés, o identificador de conexão da conexão que já esta aberta será retornado.

source: The link to the server will be closed as soon as the execution of the script ends, unless it' s closed earlier by explicitly calling mssql_close().
pt_br: A conexão com o servidor será fechada assim que a execução do script terminar, a menos que seja fechada antes explicitamente por mssql_close().

source: See also mssql_pconnect(), mssql_close().
pt_br: Veja também mssql_pconnect(), mssql_close().

source: TRUE on success, FALSE on failure.
pt_br: Retorna:

source: mssql_data_seek() moves the internal row pointer of the MS SQL result associated with the specified result identifier to point to the specified row number.
pt_br: mssql_data_seek() move o ponteiro interno da linha do resultado indicado por result_identifier para o numero da linha especificado.

source: The next call to mssql_fetch_row() would return that row.
pt_br: A próxima chamada a mssql_fetch_row() irá retornar esta linha.

source: See also: mssql_data_seek().
pt_br: Veja também: mssql_data_seek().

source: In that case use mssql_next_result() to shift through the results.
pt_br: Atenção

source: See also mssql_bind(), mssql_free_statement() and mssql_init()
pt_br: Esta função não está documentada, somente a lista de argumentos está disponível.

source: An array that corresponds to the fetched row, or FALSE if there are no more rows.
pt_br: Retorna: uma array que corresponde a linha, ou FALSE se não houver mais linhas.

source: mssql_fetch_array() is an extended version of mssql_fetch_row().
pt_br: mssql_fetch_array() é uma versão estendida de mssql_fetch_row().

source: In addition to storing the data in the numeric indices of the result array, it also stores the data in associative indices, using the field names as keys.
pt_br: Alem de guardar os dados em uma matriz com índices numéricos, também guarda os dados em uma matriz associativa, usando os nomes dos campos como chave.

source: An important thing to note is that using mssql_fetch_array() is NOT significantly slower than using mssql_fetch_row(), while it provides a significant added value.
pt_br: Uma coisa importante para notar é que usar mssql_fetch_array() NÃO é significativamente mais lento do que usar mssql_fetch_row(), enquanto que é mais fácil de usar.

source: For further details, also see mssql_fetch_row().
pt_br: Para maiores detalhes veja também mssql_fetch_row().

source: Returns an object containing field information.
pt_br: Descrição

source: mssql_fetch_field() can be used in order to obtain information about fields in a certain query result.
pt_br: mssql_fetch_field() pode ser usada para obter informações sobre os campos do resultado de uma query.

source: If the field offset isn' t specified, the next field that wasn't yet retrieved by mssql_fetch_field() is retrieved.
pt_br: Se o índice do campo não for especificado, o próximo campo que ainda não foi recuperado por mssql_fetch_field() é retornado.

source: The properties of the object are:
pt_br: As propriedades do objeto são:

source: name - column name. if the column is a result of a function, this property is set to computed#N, where #N is a serial number.
pt_br: Se a coluna é resultado de alguma função, esta propriedade é estabelecida como computed#N, aonde #N é um número de série.

source: column_source - the table from which the column was taken
pt_br: column_source - a tabela de onde a coluna veio

source: max_length - maximum length of the column
pt_br: max_length - o limite de tamanho da coluna

source: numeric - 1 if the column is numeric
pt_br: numeric - 1 se a coluna é numérica

source: See also mssql_field_seek().
pt_br: Veja também mssql_field_seek().

source: An object with properties that correspond to the fetched row, or FALSE if there are no more rows.
pt_br: Um objeto com propriedades que correspondem a linha, ou FALSE se não houver mais linhas.

source: mssql_fetch_object() is similar to mssql_fetch_array(), with one difference - an object is returned, instead of an array.
pt_br: mssql_fetch_object() é similar a mssql_fetch_array(), com uma diferença - um objeto é retornado, ao invés de uma matriz.

source: Indirectly, that means that you can only access the data by the field names, and not by their offsets (numbers are illegal property names).
pt_br: Indiretamente, isto indica que você só pode acessar os dados pelo nome dos campos, e não por seus índices (números são nomes de propriedades ilegais).

source: Speed-wise, the function is identical to mssql_fetch_array(), and almost as quick as mssql_fetch_row() (the difference is insignificant).
pt_br: Em velocidade, esta função é idêntica a mssql_fetch_array(), e quase tão rápida quanto mssql_fetch_row() (a diferença é insignificante).

source: See also: mssql_fetch-array() and mssql_fetch-row().
pt_br: Veja também: mssql_fetch-array() e mssql_fetch-row().

source: mssql_fetch_row() fetches one row of data from the result associated with the specified result identifier.
pt_br: mssql_fetch_row() retorna uma linha do resultado identificado por result.

source: The row is returned as an array.
pt_br: A linha é retornada como uma matriz.

source: Each result column is stored in an array offset, starting at offset 0.
pt_br: Cada coluna do resultado é guardada com um índice numérico, começando no 0.

source: Subsequent call to mssql_fetch_rows() would return the next row in the result set, or FALSE if there are no more rows.
pt_br: A próxima chamada para mssql_fetch_rows() deve retornar a próxima linha do conjunto de resultados, ou FALSE se não houver mais linhas.

source: See also: mssql_fetch_array(), mssql_fetch_object(), mssql_data_seek(), mssql_fetch_lengths(), and mssql_result().
pt_br: Veja também: mssql_fetch_array(), mssql_fetch_object(), mssql_data_seek(), mssql_fetch_lengths(), e mssql_result().

source: If the next call to mssql_fetch_field() won't include a field offset, this field would be returned.
pt_br: Se a próxima chamada a mssql_fetch_field() não incluir um índice do campo, este campo será retornado.

source: See also: mssql_fetch_field().
pt_br: Veja também: mssql_fetch_field().

source: mssql_free_result() only needs to be called if you are worried about using too much memory while your script is running.
pt_br: mssql_free_result() somente precisa ser chamado se você esta preocupado com a quantidade de memória usada enquanto o seu script esta sendo executado.

source: All result memory will automatically be freed when the script ends.
pt_br: Toda a memória do resultado é liberada automaticamente quando o script acaba.

source: You may call mssql_free_result() with the result identifier as an argument and the associated result memory will be freed.
pt_br: Você deve chamar mssql_free_result() com o identificador do resultado que você quer liberar da memória.

source: See also mssql_bind(), mssql_execute() and mssql_free_statement()
pt_br: Esta função não está documentada, somente a lista de argumentos está disponível.

source: When sending more than one SQL statement to the server or executing a stored procedure with multiple results, it will cause the server to return multiple result sets.
pt_br: Quando se envia mais de uma sql para o servidor ou executando uma stored procedure com múltiplos resultados, irá causar que o servidor retorne múltiplos conjuntos de resultados.

source: This function will test for additional results available form the server.
pt_br: Esta função irá testar se há resultados adicionais do servidor.

source: If an additional result set exists it will free the existing result set and prepare to fetch the rows from the new result set.
pt_br: Se existir um conjunto adicional de resultados, irá liberar o conjunto atual de resultados e preparar para usar o novo conjunto de resultados.

source: The function will return TRUE if an additional result set was available or FALSE otherwise.
pt_br: A função irá retornar TRUE se um conjunto adicional de resultados estiver disponível ou FALSE em outro caso.

source: Example 1. mssql_next_result() example
pt_br: Exemplo mssql_next_result()

source: mssql_num_fields() returns the number of fields in a result set.
pt_br: mssql_num_fields() retorna o número de campos em um conjunto de resultados.

source: See also: mssql_db_query(), mssql_query(), mssql_fetch_field(), and mssql_num_rows().
pt_br: Veja também: mssql_db_query(), mssql_query(), mssql_fetch_field(), e mssql_num_rows().

source: mssql_num_rows() returns the number of rows in a result set.
pt_br: mssql_num_rows() retorna o número de linhas em um conjunto de resultados.

source: See also: mssql_db_query(), mssql_query(), and mssql_fetch_row().
pt_br: Veja também: mssql_db_query(), mssql_query(), e mssql_fetch_row().

source: A positive MS SQL persistent link identifier on success, or FALSE on error.
pt_br: Retorna: um identificador de link persistente com MS SQL se funcionar, ou FALSE se houver erro.

source: mssql_pconnect() acts very much like mssql_connect() with two major differences.
pt_br: mssql_pconnect() funciona muito parecido com mssql_connect() com duas diferenças maiores.

source: First, when connecting, the function would first try to find a (persistent) link that's already open with the same host, username and password.
pt_br: Primeiro, ao conectar, a função irá primeiro tentar achar uma conexão (persistente) que já esteja aberta com o mesmo host, username e password.

source: If one is found, an identifier for it will be returned instead of opening a new connection.
pt_br: Se uma é encontrada, um identificador para ela será retornada ao invés de abrir uma nova conexão.

source: Second, the connection to the SQL server will not be closed when the execution of the script ends.
pt_br: Segundo, a conexão ao servidor SQL não será fechada quando a execução do script terminar.

source: Instead, the link will remain open for future use (mssql_close() will not close links established by mssql_pconnect()).
pt_br: Ao invés, a conexão permanecerá aberta para uso futuro (mssql_close() não irá fechar conexões criadas com mssql_pconnect()).

source: This type of links is therefore called 'persistent'.
pt_br: Este tipo de conexão é chamado 'Persistente'.

source: A positive MS SQL result identifier on success, or FALSE on error.
pt_br: Retorna: um identificador de resultado do MS SQL se funcionar, ou FALSE se houver um erro.

source: mssql_query() sends a query to the currently active database on the server that's associated with the specified link identifier.
pt_br: mssql_query() envia uma query para o banco de dados atual no servidor que esta associado a conexão especificada em link_identifier.

source: If no link is open, the function tries to establish a link as if mssql_connect() was called, and use it.
pt_br: Se nenhuma conexão estiver aberta, a função tenta criar um como se mssql_connect() fosse chamada, e irá usa-la.

source: See also: mssql_db_query(), mssql_select_db(), and mssql_connect().
pt_br: Veja também: mssql_db_query(), mssql_select_db() ,e mssql_connect().

source: mssql_result() returns the contents of one cell from a MS SQL result set.
pt_br: mssql_result() retorna o conteúdo de uma célula de um conjunto de resultados do MS SQL.

source: The field argument can be the field' s offset, the field's name or the field's table dot field's name (tablename.fieldname).
pt_br: O argumento field pode ser o índice do campo, o nome do campo ou a tabela do campo ponto o nome do campo (tabela.campo).

source: If the column name has been aliased ('select foo as bar from.. .'), it uses the alias instead of the column name.
pt_br: Se um nome da coluna tem apelido ('select foo as bar from.. .'), use o apelido ao invés do nome da coluna.

source: When working on large result sets, you should consider using one of the functions that fetch an entire row (specified below).
pt_br: Quando estiver trabalhando com grandes conjuntos de resultados, você deve considerar o uso de funções que retornam toda a linha (especificadas abaixo).

source: As these functions return the contents of multiple cells in one function call, they' re MUCH quicker than mssql_result().
pt_br: Como estas funções retornam múltiplas células em uma chamada de função, elas são MUITO mais rápidas do que mssql_result().

source: Also, note that specifying a numeric offset for the field argument is much quicker than specifying a fieldname or tablename.fieldname argument.
pt_br: Também note que especificar um índice numérico para o argumento field é muito mais rápido do que especificar um nome de campo ou tabela.campo.

source: Recommended high-performance alternatives: mssql_fetch_row(), mssql_fetch_array(), and mssql_fetch_object().
pt_br: Alternativas mais rápidas recomendadas: mssql_fetch_row(), mssql_fetch_array(), e mssql_fetch_object().

source: TRUE on success, FALSE on error
pt_br: Retorna:

source: mssql_select_db() sets the current active database on the server that's associated with the specified link identifier.
pt_br: mssql_select_db() estabelece o banco de dados ativo para a conexão especificada por link_identifier.

source: If no link identifier is specified, the last opened link is assumed.
pt_br: Se nenhum identificador de conexão for especificado, a ultima conexão aberta é usada.

source: If no link is open, the function will try to establish a link as if mssql_connect() was called, and use it.
pt_br: Se nenhuma conexão estiver aberta a função tentará estabelecer uma como se mssql_connect() fosse chamada, e irá usa-la.

source: Every subsequent call to mssql_query() will be made on the active database.
pt_br: Todas as próximas chamadas a mssql_query() serão feitas no banco de dados ativo.

source: See also: mssql_connect(), mssql_pconnect(), and mssql_query()
pt_br: Veja também: mssql_connect(), mssql_pconnect(), e mssql_query()
